/*
Установка локального сервера

Шаг 1: Установка Node.js
- Перейдите на официальный сайт Node.js по адресу https://nodejs.org.
- Скачайте установщик Node.js для вашей операционной системы (рекомендуется LTS-версия).
- Запустите установщик и следуйте инструкциям мастера установки.
- По завершении установки у вас будет установлена Node.js и пакетный менеджер npm.




Шаг 2: Установка пакета http-server
- Откройте командную строку (терминал) на вашем компьютере.
- Введите следующую команду и нажмите Enter, чтобы глобально установить пакет http-server:

npm install -g http-server

- Дождитесь завершения установки пакета.




Шаг 3: Запуск локального сервера
- Перейдите в каталог, где находится ваш проект (например, `E:\workWithDmitriy\main`).
- В командной строке (терминале) введите следующую команду и нажмите Enter, чтобы запустить локальный сервер:

http-server

- Локальный сервер будет запущен на адресе `http://localhost:8080` (по умолчанию) или на другом порту, если порт 8080 уже занят.
- Вы должны увидеть сообщение о том, что сервер запущен и указаны доступные URL-адреса.
*/
